---
kind: enumMember
id: F:Autodesk.Revit.DB.TessellatedBuildIssueType.PartitionPointsTooFarFromTrueEdge
enum: Autodesk.Revit.DB.TessellatedBuildIssueType
source: html/b9f37bb0-1c2b-0fe9-a4e8-5a49d2b9b7ac.htm
---
# Autodesk.Revit.DB.TessellatedBuildIssueType.PartitionPointsTooFarFromTrueEdge

Points representing partitions of input points are too far from
 the true edge.
 Associated numbers are face and loop indices, an index of the
 vertex in the beginning of the segment which is too far from
 the corresponding true edge, an index of another involved face
 respectively.